Ran Plan for 6 projects:

1. dir: `01_IAM` workspace: `default`
1. dir: `02_Route53/rhea-so.com/atlantis.rhea-so.com` workspace: `default`
1. dir: `.` workspace: `default`
1. dir: `02_Route53/rhea-so.com` workspace: `default`
1. dir: `97_Service/Memo` workspace: `default`
1. dir: `98_Example` workspace: `default`

### 1. dir: `01_IAM` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_access_key.load-balancer-access-key will be created
+ resource "aws_iam_access_key" "load-balancer-access-key" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "loadbalancer"
    }

  # aws_iam_user.load-balancer will be created
+ resource "aws_iam_user" "load-balancer" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "loadbalancer"
      + path          = "/system/"
      + tags          = {
          + "tag-key" = "tag-value"
        }
      + tags_all      = {
          + "tag-key" = "tag-value"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy.load-balancer-user-policy will be created
+ resource "aws_iam_user_policy" "load-balancer-user-policy" {
      + id     = (known after apply)
      + name   = "test"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user   = "loadbalancer"
    }

Plan: 3 to add, 0 to change, 0 to destroy.


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. dir: `02_Route53/rhea-so.com/atlantis.rhea-so.com` workspace: `default`
**Plan Error**
```
running "/usr/bin/terraform plan -input=false -refresh -out \"/home/ubuntu/.atlantis/repos/rhea-so-lab/Infrastructure-as-Code/85/default/02_Route53/rhea-so.com/atlantis.rhea-so.com/default.tfplan\"" in "/home/ubuntu/.atlantis/repos/rhea-so-lab/Infrastructure-as-Code/85/default/02_Route53/rhea-so.com/atlantis.rhea-so.com": exit status 1
╷
│ Error: Unsupported attribute
│ 
│   on domain.tf line 6, in resource "aws_route53_record" "atlantis-rhea-so":
│    6:   zone_id = module.rhea-so.zone_id
│     ├────────────────
│     │ module.rhea-so is a object, known only after apply
│ 
│ This object does not have an attribute named "zone_id".
╵

```

---
### 3. dir: `.` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
- destroy

Terraform will perform the following actions:

  # aws_route53_record.memo-domain will be destroyed
  # (because aws_route53_record.memo-domain is not in configuration)
- resource "aws_route53_record" "memo-domain" {
      - fqdn    = "atlantis.rhea-so.com" -> null
      - id      = "Z02629952Z1ESWD7VTUX1_atlantis.rhea-so.com_A" -> null
      - name    = "atlantis.rhea-so.com" -> null
      - records = [
          - "52.78.144.248",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z02629952Z1ESWD7VTUX1" -> null
    }

  # aws_route53_zone.rhea-so will be destroyed
  # (because aws_route53_zone.rhea-so is not in configuration)
- resource "aws_route53_zone" "rhea-so" {
      - arn           = "arn:aws:route53:::hostedzone/Z02629952Z1ESWD7VTUX1" -> null
      - comment       = "Managed by Terraform" -> null
      - force_destroy = true -> null
      - id            = "Z02629952Z1ESWD7VTUX1" -> null
      - name          = "rhea-so.com" -> null
      - name_servers  = [
          - "ns-1390.awsdns-45.org",
          - "ns-1701.awsdns-20.co.uk",
          - "ns-428.awsdns-53.com",
          - "ns-946.awsdns-54.net",
        ] -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - zone_id       = "Z02629952Z1ESWD7VTUX1" -> null
    }

Plan: 0 to add, 0 to change, 2 to destroy.


```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>
Plan: 0 to add, 0 to change, 2 to destroy.

---
### 4. dir: `02_Route53/rhea-so.com` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_route53_zone.rhea-so will be created
+ resource "aws_route53_zone" "rhea-so" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = true
      + id            = (known after apply)
      + name          = "rhea-so.com"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ zone-id = (known after apply)

```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 5. dir: `97_Service/Memo` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

This plan was not saved because one or more projects failed and automerge requires all plans pass.

---
### 6. dir: `98_Example` workspace: `default`
```diff

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

This plan was not saved because one or more projects failed and automerge requires all plans pass.

---

